HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/twoSimpleRotors/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|hole)"
    {
        type            zeroGradient;
    }

   outlet
   {
       type            fixedValue;
       value           uniform 0;
   }
   inlet
   {
       type            zeroGradient;
   }
//
//    right1
//    {
//        type            fixedValue;   //calculated;
//        value           $internalField;
//    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
